import { db } from "./db"
import { products } from "./schema"

async function seed() {
  await db.delete(products)
  await db.insert(products).values([
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
    {
      title: "С креветками и трюфелями",
      price: 600,
      description: "Домашняя паста феттуччине, сливочный соус, креветки, трюфельное масло, черный перец, пармезан. 350 г",
    },
  ])

  console.log("Данные добавлены")
}

seed()